#include <iostream>
using namespace std;
int main(){
	int a,b,c,d,e,g,c1,d1,e1,g1;
	cin>>a;
	c=a/60;
	c1=a%60;
	setlocale(LC_ALL, "Russian");
	if (c1>=38) {
		c=c+1;
		cout<<c<<" билет(ов) на 60 поездок, ";
		return 0;
	}
	d=c1/20;
	d1=c1%20;
	if (d1>=18) {
		d=d+1;
		cout<<c<<" билет(ов) на 60 поездок, "<<d<<" билет(ов) на 20 поездок, ";
		return 0;
	}
	e=d1/10;
	e1=d1%10;
	if (e1>=8) {
		e=e+1;
		cout<<c<<" билет(ов) на 60 поездок, "<<d<<" билет(ов) на 20 поездок, "<<e<<" билет(ов) на 10 поездок, ";
		return 0;
	}
	g=e1/5;
	g1=e1%5;
	cout<<c<<" билет(ов) на 60 поездок, "<<d<<" билет(ов) на 20 поездок, "<<e<<" билет(ов) на 10 поездок, "<<g<<" билет(ов) на 5 поездок, "<<g1<<" билет(ов) на 1 поездку";
	return 0;
}
